In [80]:
import pandas as pd
import os

In [81]:
path = 'names'
years_list = os.listdir(path)

In [82]:
def count_top(*args, count=3):
    all_data = []
    if type(args[0]) is list:
        args = args[0]
    for year in args:
        fp = f'yob{year}.txt'
        if fp in years_list:
            all_data.append(pd.read_csv(os.path.join(path, fp), names=['Name','Gender','Count']))
        else:
            print(f'Нет данных об {year}')
    all_data = pd.concat(all_data).reset_index(level=0, drop=True)
    return all_data.groupby(['Name']).sum().sort_values('Count', ascending=False).head(count)

In [83]:
count_top(1700, 1900, 1950, 2000, 2019, count=3)

Нет данных об 1700
Нет данных об 2019

         Count
Name
James   111789
John    109601
Robert  101368

In [84]:
def count_dynamics(*args):
    all_data = []
    if type(args[0]) is list:
        args = args[0]
    counter = 0
    for year in args:
        fp = f'yob{year}.txt'
        if fp in years_list:
            all_data.append(pd.read_csv(os.path.join(path, fp), names=['Name','Gender','Count']))
            all_data[counter]['Year'] = year
        else:
            counter -= 1
            print(f'Нет данных об {year}')
        counter += 1
    all_data = pd.concat(all_data).reset_index(level=0, drop=True)
    return all_data.groupby(['Gender', 'Year']).sum()

In [85]:
count_dynamics(1700, 1900, 1950, 2000, 2019)

Нет данных об 1700
Нет данных об 2019

               Count
Gender Year
F      1900   299798
       1950  1713065
       2000  1815295
M      1900   150480
       1950  1790437
       2000  1963202

In [86]:
count_dynamics([i for i in range(1910,1915)])

              Count
Gender Year
F      1910  396505
       1911  418309
       1912  558121
       1913  624547
       1914  761580
M      1910  194212
       1911  225970
       1912  429945
       1913  512567
       1914  654764